; domain
;This is a story about a wolf cub named Wilf who gets lost
;in the Tundra during a blizzard, but then finds his way back to his family, with the
;help of his animal friends.
;
;Original story book written by Rachel Bright and illustrated by Jim Field
;Scholastic Press 2020
;
;Wilf can be guided from one location to another if
;Wilf is at location1, and location1 and location2 are connected,
;and there is a friend at location1 who is capable of guiding Wilf to location2.
;Wilf is safely at home when he reaches the Den

(define (domain wilf_journey1)

    (:requirements
        :equality
        :typing
        
    )


    (:types friend location wilf
    )

    (:constants

    )

    (:predicates
    	(hasFriend ?l1 - location ?f - friend)
        (isConnected ?l1 - location ?l2 - location)
        (at ?l1 - location ?w1 - wilf)
        (canGuide ?l1 - location ?l2 - location ?f - friend)
        (canCarry ?l1 - location ?l2 - location ?f - friend)

    )

    (:functions

    )

    (:action guide
        :parameters (?f - friend ?w - wilf ?l1 - location ?l2 - location)
        :precondition (and (isConnected ?l1 ?l2) (at ?l1 ?w) (hasFriend ?l1 ?f) (canGuide ?l1 ?l2 ?f)
         )
        :effect (and (at ?l2 ?w )
         (not (at ?l1 ?w )) (not (hasFriend ?l1 ?f)))
    )

    (:action carry
        :parameters (?f - friend ?w - wilf ?l1 - location ?l2 - location)
        :precondition (and (isConnected ?l1 ?l2) (at ?l1 ?w) (hasFriend ?l1 ?f) (canCarry ?l1 ?l2 ?f)
         )
        :effect (and (at ?l2 ?w )
         (not (at ?l1 ?w )) (not (hasFriend ?l1 ?f)))
    )

)

; problem
(define (problem wilf_journey3)
   (:domain wilf_journey1)

   (:objects
      Wilf - wilf
      Narwhal Walrus
      Musk_ox Arctic_fox Wolf_family
	  Moose Goose Bear_moth Polar_Bear - friend
	  Iceberg Shore
      Ridge Bridge Stream
      Trees Valley Wilds Den - location
   )

   (:init
	  (at Iceberg Wilf)
      (isConnected Iceberg Shore)
      (isConnected Shore Ridge)
      (isConnected Ridge Bridge)
      (isConnected Bridge Trees)
      (isConnected Trees Valley)
      (isConnected Valley Wilds)
      (isConnected Wilds Stream)
      (isConnected Stream Den)
      (hasFriend Iceberg Narwhal)
      (hasFriend Iceberg Polar_Bear)
      (hasFriend Shore Walrus)
      (hasFriend Ridge Musk_ox)
      (hasFriend Bridge Arctic_fox)
      (hasFriend Trees Goose)
      (hasFriend Valley Moose)
      (hasFriend Wilds Bear_moth)
      (hasFriend Stream Wolf_family)
      (canCarry Iceberg Shore Narwhal)
      (canCarry Iceberg Shore Polar_Bear)
      (canCarry Shore Ridge Walrus)
      (canCarry Ridge Bridge Musk_ox)
      (canGuide Bridge Trees Arctic_fox)
      (canGuide Trees Valley Goose)
      (canCarry Valley Wilds Moose)
      (canGuide Wilds Stream Bear_moth)
      (canCarry Stream Den Wolf_family)

   )


  (:goal (at Den Wilf)

   )

)

; plan
1. (carry polar_bear wilf iceberg shore)
   deleted: (at iceberg wilf) (hasfriend iceberg polar_bear)
   added: (at shore wilf)
   goals met: 0 of 1
2. (carry walrus wilf shore ridge)
   deleted: (at shore wilf) (hasfriend shore walrus)
   added: (at ridge wilf)
   goals met: 0 of 1
3. (carry musk_ox wilf ridge bridge)
   deleted: (at ridge wilf) (hasfriend ridge musk_ox)
   added: (at bridge wilf)
   goals met: 0 of 1
4. (guide arctic_fox wilf bridge trees)
   deleted: (at bridge wilf) (hasfriend bridge arctic_fox)
   added: (at trees wilf)
   goals met: 0 of 1
5. (guide goose wilf trees valley)
   deleted: (at trees wilf) (hasfriend trees goose)
   added: (at valley wilf)
   goals met: 0 of 1
6. (carry moose wilf valley wilds)
   deleted: (at valley wilf) (hasfriend valley moose)
   added: (at wilds wilf)
   goals met: 0 of 1
7. (guide bear_moth wilf wilds stream)
   deleted: (at wilds wilf) (hasfriend wilds bear_moth)
   added: (at stream wilf)
   goals met: 0 of 1
8. (carry wolf_family wilf stream den)
   deleted: (at stream wilf) (hasfriend stream wolf_family)
   added: (at den wilf)
   goals met: 1 of 1
